$(document).ready(function () {
    $('.slider').slick({
        // включаємо наші кнопки
        arrows: true,
        // включаємо точки, за замовчуванням вони виключені
        dots: true,
        // автоматична адаптивна висота слайдера, при включенні цієї опції, 
        // слайдер буде автоматично підлаштовуватися по висоті, під конкретний слайд
        adaptiveHeight: true,
        // вказуємо кількість слайдів, які ми холемо відобразити за один раз
        slidesToShow: 3,
        // вказуємо к-сть слайдів, які будуть прокручуватися при одному натисканні стрілки або кнопки
        // по замовчуванню вказується 1 
        slidesToScroll: 1,
        // функція, яка відповідає за швидкість прокручувааня наших слайдів 
        // за замовчуванням, це 300 мілісекунд 
        speed: 1000,
        // відповідає за тип анімаії, при зміні слайду, по замовчуванню "linear"
        easing: 'ease',
        // відповідає за те, чи буде слайд безкінечний, по замовчуванню true
        // коли дійде до останньої картинки, не буде прокркчуватися вперед
        infinite: true,
        // стартуємо з нульового слайду
        initialSlide: 0,
        // автоматично перегортуються слайди 
        autoplay: false,
        // через певний період
        autoplaySpeed: 1000,
        // ставимо на паузу наше прокручування, коли ми наводимо мишкою на слайдер
        pauseOnFocus: true,
        pauseOnHover: true,
        pauseOnDotsHover: true,
        // на  пк (чи можна мишкою прокручувати фото)
        draggable: false,
        // на мобільному
        swipe: true,
        // 
        touchThreshold: 10,
        touchMove: true,
        // наскільки швидко, принатисканні стрілочки, буде рухатимся слайд
        // по замовчувааню true
        waitForAnimate: false,
        // наступні дві функції важливі
        // перший слайд по центру true (видно край останнбого фото)
        centerMode: true,
        // ставить всі фото один біля одного без відступів true
        variableWidth: false,
    
        // змінюємо медіа
        responsive: [
            {
                breakpoint: 768,
                setting: {
                    slidesToShow: 2,
                }
            },{
                breakpoint: 480,
                setting: {
                    slidesToShow: 1,
                }          
            }
        ]
    });
});

//  w  ц